In [9]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [3]:
d = {
    "Area":[2600,3000,3200,3600,4000],
    "Room":[3,4,np.nan,3,5],
    "Old":[20,15,18,30,8],
    "Price":[55000,56500,61000,59500,76000]
}
data = pd.DataFrame(d)
data

   Area  Room  Old  Price
0  2600   3.0   20  55000
1  3000   4.0   15  56500
2  3200   NaN   18  61000
3  3600   3.0   30  59500
4  4000   5.0    8  76000

In [6]:
data.fillna(data['Room'].mean(),inplace=True)

In [7]:
data

   Area  Room  Old  Price
0  2600  3.00   20  55000
1  3000  4.00   15  56500
2  3200  3.75   18  61000
3  3600  3.00   30  59500
4  4000  5.00    8  76000

In [11]:
x=data.drop("Price",axis=1)
y = data["Price"]
x

   Area  Room  Old
0  2600  3.00   20
1  3000  4.00   15
2  3200  3.75   18
3  3600  3.00   30
4  4000  5.00    8

In [12]:
y

0    55000
1    56500
2    61000
3    59500
4    76000
Name: Price, dtype: int64

In [13]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [14]:
model = LinearRegression()

In [15]:
model.fit(x,y)

LinearRegression()

In [17]:
y_predicted = model.predict(x)
y_predicted

array([55174.7397557 , 56882.2432156 , 60126.30122149, 59680.20037307,
       76136.51543414])

In [27]:
t = {
    "Area":[3000],
    "Room":[3],
    "Old":[40],
}
test = pd.DataFrame(t)
model.predict(test)

array([27289.93922619])